IDEA Connection Link
ConnectionSrv.CalculateProject Method
 CalculateProject
 Namespace: IdeaRS.ConnectionService.Service
 Assembly: IdeaRS.ConnectionLink (in IdeaRS.ConnectionLink.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public ConnectionResultsData CalculateProject(
	Guid connectionId
)
Public Function CalculateProject (
	connectionId As Guid
) As ConnectionResultsData
public:
ConnectionResultsData^ CalculateProject(
	Guid connectionId
)
Parameters
connectionId
Type: System.Guid
[Missing <param name="connectionId"/> documentation for "M:IdeaRS.ConnectionService.Service.ConnectionSrv.CalculateProject(System.Guid)"]
Return Value
Type: ConnectionResultsData
[Missing <returns> documentation for "M:IdeaRS.ConnectionService.Service.ConnectionSrv.CalculateProject(System.Guid)"]
See Also
Reference
ConnectionSrv Class
IdeaRS.ConnectionService.Service Namespace